app/Controllers/Categorias.php

    public function index () {

        //chamar uma view que exige todas as categorias
        $categoriaModel = new \App\Models\CategoriaModel();
        $data['categorias'] = $categoriaModel->find(); //todas categorias buscadas pelo método find
---
SELECT *
FROM `categoria`

    public function inserir () {
        $data['titulo'] = 'Inserir nova categoria';
        $data['acao'] = 'Inserir';
        $data['msg'] = '';

        if($this->request->getMethod() === 'post'){
            $categoriaModel = new \App\Models\CategoriaModel();
            $categoriaModel->set('nomecategoria', $this->request->getPost('nomecategoria'));

            if($categoriaModel->insert()){
---
INSERT INTO `categoria` (`nomecategoria`) VALUES ('Electrodomésticos')

    public function editar ($id) {
        $data['titulo'] = 'Editar categoria ' . $id;
        $data['acao'] = 'Editar';
        $data['msg'] = '';
        $categoriaModel = new \App\Models\CategoriaModel();
        $categoria = $categoriaModel->find($id);
---
SELECT *
FROM `categoria`
WHERE `categoria`.`id` = '1'