app/Controllers/Produtos.php

SELECT *
FROM `categoria`
---
    public function inserir() //método padrão
    {
        $data['titulo'] = 'Inserir novo produto';
        $data['acao'] = 'Inserir';
        $data['msg'] = '';
        $data['erros'] = '';


        if($this->request->getMethod() === 'post') { // para saber se aquele formulário foi ou não foi submetido
            // instanciamos o model e depois seta os valores
            $produtoModel = new \App\Models\ProdutoModel(); // se foi submetido vai criar uma instância do produto model, vai setar os valores a serem salvos (o valor e a categoria) ai chama método insert para inserir no BD.
            $dadosProduto = $this->request->getPost(); // não precisa colocar 10 vezes o mesmo código (se tiver 10 colunas) - getPost retorna todos os dados

            if($produtoModel->insert($dadosProduto)){
                // deu certo
                $data['msg'] = 'Produto inserido com sucesso';
            }
            else{
                // deu errado
                $data['msg'] = 'Erro ao inserir produto';
                $data['erros'] = $produtoModel->errors();

            }
        }

        //combo para exibir as categoria
        $categoriaModel = new \App\Models\CategoriaModel();
        $listaCategoria = $categoriaModel->findAll(); // busca de todas categorias e retornar elas dentro do lista categorias